{
  "experiences": [
    {
      "id": "stage-dev-fullstack",
      "nom": "Stage Développeur Full-Stack",
      "description": "Stage de 8 mois chez l'entreprise AK Digital en tant que développeur full-stack. Développement d'une application web de gestion de projets avec Next.js et Node.js. Développement WordPress.",
      "image": "./images/akdigital.jpg",
      "lien": "https://akdigital.fr/",
      "type": "professionnelle",
      "date": "2025-04-14",
      "competencesEtudiees": [
        {
          "nom": "Réaliser un développement d'application",
          "description": "Cette compétence m'a apporté les connaissances essentielles du développement RESTful pour appréhender au mieux l'application Next."
        },
        {
          "nom": "Optimiser des applications informatiques",
          "description": "Ces connaissances m'ont permis de résoudre des problèmes complexes afin d'améliorer au mieux les performances de l'application. Tel que l'optimisation des rooms websockets ou bien l'utilisation de design patterns comme le singleton ou le factory."
        },
        {
          "nom": "Gérer des données de l'information",
          "description": "Cette compétence est cruciale pour la gestion de l'API. En effet, durant le stage, j'ai du gérer plusieurs controlleurs qui interagissent avec la base de données. De plus, j'ai fortement utilisé MongoDB que je connaissais déjà."
        },
        {
          "nom": "Travailler dans une équipe informatique",
          "description": "Durant le stage, j'ai travaillé étroitement avec mon maître de stage. J'ai donc du m'adapter aux normes de l'entreprise et aux outils utilisés."
        }
      ]
    },
    {
      "id": "bac-sti2d",
      "nom": "Baccalauréat STI2D Spécialité SIN",
      "description": "J'ai toujours été passionné par l'informatique. Je ne voulais pas faire un parcours général car je voulais une formation précise, mais pas autant précise qu'un bac professionnel. Je me suis donc naturellement dirigé vers le bac STI2D, spécialité SIN. Ce qui m'a permis d'avoir de très bonnes bases pour mes études supérieures.",
      "image": "./images/sti2d.png",
      "lien": "https://fabrecarpentras.fr/fr/formations/16/bac-technologique",
      "type": "etudes",
      "date": "2021-09-01",
      "competencesEtudiees": [
        {
          "nom": "Réaliser un développement d'application",
          "description": "Cette formation m'a initié à la programmation. J'ai appris à utiliser des langages de programmation comme le C++, le c# et le python."
        },
        {
          "nom": "Travailler dans une équipe informatique",
          "description": "J'ai beaucoup aimé la dernière année. En effet, c'était la première fois que je travaillais en équipe sur un gros projet. Nous devions concevoir un bateau télécommandé, qui devait prendre des mesures de l'eau. J'ai donc du travailler avec différentes personnes, qui avaient différentes compétences."
        }
      ]
    },
    {
      "id": "president-bde",
      "nom": "Président du BDE Informatique",
      "description": "J'ai été président du BDE Informatique de l'IUT Informatique de Lyon 1. J'ai donc dû gérer une équipe d'une dizaine de personnes. J'ai également dû gérer des projets de grande ampleur comme un weekend étudiant ou bien la Nuit de l'info, une compétition nationale.",
      "image": "./images/bde-info-logo.jpg",
      "lien": "https://iut.univ-lyon1.fr/vie-etudiante/associations-etudiantes/bde-info-iut-lyon-1",
      "type": "personnelle",
      "date": "2023-03-24",
      "competencesEtudiees": [
        {
          "nom": "Conduire un projet",
          "description": "Cette expérience m'a permis de développer mes compétences en gestion de projet. J'ai donc dû m'adapter à différents contextes et à différentes personnes."
        }
      ]
    },
    {
      "id": "but-informatique",
      "nom": "BUT Informatique à l'IUT Informatique de Lyon 1",
      "description": "Je suis en 2ème année de BUT Informatique à l'IUT Informatique de Lyon 1. J'ai donc suivi une formation qui m'a permis de développer mes compétences en programmation, en réseaux et en gestion de projet. Cela m'a permis notamment de faire ce Portfolio.",
      "image": "./images/logo_iut.webp",
      "lien": "https://iut.univ-lyon1.fr/",
      "type": "etudes",
      "date": "2022-09-01",
      "competencesEtudiees": [
        {
          "nom": "Réaliser un développement d'application",
          "description": "Ma formation m'apprend à utiliser des langages de programmation comme le C, le Java, le Python, le PHP, le JavaScript, le TypeScript, le SQL, le NoSQL, le HTML, le CSS."
        },
        {
          "nom": "Optimiser des applications informatiques",
          "description": "Cette formation éveille notre esprit critique. En effet, nous sommes amenés à résoudre des problèmes algorithmiques complexes."
        },
        {
          "nom": "Administrer des systèmes informatiques communicants complexes",
          "description": "J'ai appris à administrer des systèmes informatiques. En effet, j'ai été amené à configurer des routeurs, des serveurs DNS, DHCP, afin de communiquer entre plusieurs sous réseaux."
        },
        {
          "nom": "Gérer des données de l'information",
          "description": "J'ai appris à manipuler des bases de données avec du SQL, du NoSQL et du MongoDB. J'ai également appris à utiliser phpMyAdmin mais aussi PowerBI."
        },
        {
          "nom": "Conduire un projet",
          "description": "La formation apporte un grand bagage en gestion de projet. En effet, nous sommes amenés à nous placer en tant que chef de projet, avec la conception d'un cahier des charges complet. Nous apprenons aussi des techniques de gestion de projet comme la méthode agile mais aussi des techniques de management."
        },
        {
          "nom": "Travailler dans une équipe informatique",
          "description": "La formation nous pousse à travailler en équipe. Nous devons réaliser plusieurs SAE, les SAE sont des projets de groupe à faire en autonomie. Cela nous permet d'améliorer notre communication."
        }
      ]
    },
    {
      "id": "benevole-stud",
      "nom": "Membre de la Student Club",
      "description": "A la suite de mon mandat de président du BDE Informatique, je me suis engagé dans la Student Club. C'est une fédération de site, elle aide les BDE de son site, ici la Doua, un campus de l'Université Claude Bernard Lyon 1.",
      "image": "./images/stud.jpg",
      "lien": "https://iut.univ-lyon1.fr/vie-etudiante/associations-etudiantes/bde-doua-iut-lyon-1",
      "type": "personnelle",
      "date": "2024-06-12",
      "competencesEtudiees": [
        {
          "nom": "Travailler dans une équipe informatique",
          "description": "J'ai travaillé avec les autres membres de la Student Club. Nous avons réalisé des projets ensemble. Cela m'a permis d'améliorer ma communication et de développer mes compétences en gestion de projet."
        }
      ]
    }
  ]
}
